###############################################################
#  Generated by:      Cadence Encounter 13.13-s017_1
#  OS:                Linux x86_64(Host ID microelnsys)
#  Generated on:      Wed Sep 14 17:43:36 2016
#  Design:            DLX
#  Command:           saveDesign DLX.enc
###############################################################
current_design DLX
create_clock [get_ports {clk}]  -name clk -period 5.000000 -waveform {0.000000 2.500000}
set_propagated_clock  [get_ports {clk}]
set_max_delay 5  -from [get_ports {Data_out_fromRAM[0] Data_out_fromRAM[1] Data_out_fromRAM[2] Data_out_fromRAM[3] Data_out_fromRAM[4] Data_out_fromRAM[5] Data_out_fromRAM[6] Data_out_fromRAM[7] Data_out_fromRAM[8] Data_out_fromRAM[9] Data_out_fromRAM[10] Data_out_fromRAM[11] Data_out_fromRAM[12] Data_out_fromRAM[13] Data_out_fromRAM[14] Data_out_fromRAM[15] Data_out_fromRAM[16] Data_out_fromRAM[17] Data_out_fromRAM[18] Data_out_fromRAM[19] Data_out_fromRAM[20] Data_out_fromRAM[21] Data_out_fromRAM[22] Data_out_fromRAM[23] Data_out_fromRAM[24] Data_out_fromRAM[25] Data_out_fromRAM[26] Data_out_fromRAM[27] Data_out_fromRAM[28] Data_out_fromRAM[29] Data_out_fromRAM[30] Data_out_fromRAM[31] iram_data[0] iram_data[1] iram_data[2] iram_data[3] iram_data[4] iram_data[5] iram_data[6] iram_data[7] iram_data[8] iram_data[9] iram_data[10] iram_data[11] iram_data[12] iram_data[13] iram_data[14] iram_data[15] iram_data[16] iram_data[17] iram_data[18] iram_data[19] iram_data[20] iram_data[21] iram_data[22] iram_data[23] iram_data[24] iram_data[25] iram_data[26] iram_data[27] iram_data[28] iram_data[29] iram_data[30] iram_data[31] rst clk}]  -to [get_ports {Data_in[0] Data_in[1] Data_in[2] Data_in[3] Data_in[4] Data_in[5] Data_in[6] Data_in[7] Data_in[8] Data_in[9] Data_in[10] Data_in[11] Data_in[12] Data_in[13] Data_in[14] Data_in[15] Data_in[16] Data_in[17] Data_in[18] Data_in[19] Data_in[20] Data_in[21] Data_in[22] Data_in[23] Data_in[24] Data_in[25] Data_in[26] Data_in[27] Data_in[28] Data_in[29] Data_in[30] Data_in[31] Address_toRAM[0] Address_toRAM[1] Address_toRAM[2] Address_toRAM[3] Address_toRAM[4] Address_toRAM[5] Address_toRAM[6] Address_toRAM[7] Address_toRAM[8] Address_toRAM[9] Address_toRAM[10] Address_toRAM[11] Address_toRAM[12] Address_toRAM[13] Address_toRAM[14] Address_toRAM[15] Address_toRAM[16] Address_toRAM[17] Address_toRAM[18] Address_toRAM[19] Address_toRAM[20] Address_toRAM[21] Address_toRAM[22] Address_toRAM[23] Address_toRAM[24] Address_toRAM[25] Address_toRAM[26] Address_toRAM[27] Address_toRAM[28] Address_toRAM[29] Address_toRAM[30] Address_toRAM[31] write_byte nibble[0] nibble[1] write_op read_op addr_to_iram[0] addr_to_iram[1] addr_to_iram[2] addr_to_iram[3] addr_to_iram[4] addr_to_iram[5] addr_to_iram[6] addr_to_iram[7] addr_to_iram[8] addr_to_iram[9] addr_to_iram[10] addr_to_iram[11] addr_to_iram[12] addr_to_iram[13] addr_to_iram[14] addr_to_iram[15] addr_to_iram[16] addr_to_iram[17] addr_to_iram[18] addr_to_iram[19] addr_to_iram[20] addr_to_iram[21] addr_to_iram[22] addr_to_iram[23] addr_to_iram[24] addr_to_iram[25] addr_to_iram[26] addr_to_iram[27] addr_to_iram[28] addr_to_iram[29] addr_to_iram[30] addr_to_iram[31]}] 
